fluidizedbedTest_20g_V_DP/CFD/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.21;  // air

boundaryField
{

    // wall
	CAD_patch1
    {
        type            zeroGradient;
    }
	CAD_patch3
    {
        type            zeroGradient;
    }
	fbBioin
    {
        type            zeroGradient;
    }
	
    fbGasin
    {
	type            fixedValue;
	value		uniform 1.21;
    }
    fbOut
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
