fluidizedbedTest_20g_V_DP/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    fbOut
    {
        type            patch;
        nFaces          25;
        startFace       29271;
    }
    CAD_patch1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4246;
        startFace       29296;
    }
    fbGasin
    {
        type            patch;
        //inGroups        1(wall);
        nFaces          96;
        startFace       33542;
    }
    CAD_patch3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       33638;
    }
    fbBioin
    {
        type            wall; //patch;
        inGroups        1(wall);
        nFaces          28;
        startFace       33734;
    }
)

// ************************************************************************* //
