fluidizedbedTest_20g_V_DP/CFD/system/controlDict_restart
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverPiso;

startFrom       startTime;

startTime       126.9;

stopAt          endTime;

endTime         336.9;

deltaT          0.0001; //0.001

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo 1; //0.1;

//libs ( "libgroovyBC.so" "libfiniteVolumeCFDEM.so");

functions
{

    probes
    {
        type        probes;
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );  
        // Name of the directory for probe data
        name        probes;
        probeLocations
        (
		(0 0 0.0001)
           	(0 0 0.0026)
           	(0 0 0.0051)
     		(0 0 0.0076)
           	(0 0 0.0101)
           	(0 0 0.0126)
           	(0 0 0.0151)
            	(0 0 0.0176)
            	(0 0 0.0201)
            	(0 0 0.0226)
            	(0 0 0.0251)
            	(0 0 0.0276)
            	(0 0 0.0301)
            	(0 0 0.0326)
            	(0 0 0.0351)
            	(0 0 0.0375)
            	(0 0 0.0401)
            	(0 0 0.0426)
            	(0 0 0.0451)
            	(0 0 0.0476)
            	(0 0 0.0501)
		(0 0 0.0001)
		(0 0 0.0026)
		(0 0 0.0051)
		(0 0 0.0076)
		(0 0 0.0101)
		(0 0 0.0126)
		(0 0 0.0151)
		(0 0 0.0176)
		(0 0 0.0201)
		(0 0 0.0226)
		(0 0 0.0251)
		(0 0 0.0276)
		(0 0 0.0301)
		(0 0 0.0326)
		(0 0 0.0351)
		(0 0 0.0376)
		(0 0 0.0401)
		(0 0 0.0426)
		(0 0 0.0451)
		(0 0 0.0476)
		(0 0 0.0501)
		(0 0 0.0526)
		(0 0 0.0551)
		(0 0 0.0576)
		(0 0 0.0601)
		(0 0 0.0626)
		(0 0 0.0651)
		(0 0 0.0676)
		(0 0 0.0701)
		(0 0 0.0726)
		(0 0 0.0751)
		(0 0 0.0776)
		(0 0 0.0801)
		(0 0 0.0826)
		(0 0 0.0851)
		(0 0 0.0876)
		(0 0 0.0901)
		(0 0 0.0926)
		(0 0 0.0951)
		(0 0 0.0976)
		(0 0 0.1001)
		(0 0 0.1026)
		(0 0 0.1051)
		(0 0 0.1076)
		(0 0 0.1101)
		(0 0 0.1126)
		(0 0 0.1151)
		(0 0 0.1176)
		(0 0 0.1201)
		(0 0 0.1226)
		(0 0 0.1251)
		(0 0 0.1276)
		(0 0 0.1301)
		(0 0 0.1326)
		(0 0 0.1351)
		(0 0 0.1376)
		(0 0 0.1401)
		(0 0 0.1426)
		(0 0 0.1451)
		(0 0 0.1476)
		(0 0 0.1501)
		(0 0 0.1526)
		(0 0 0.1551)
		(0 0 0.1576)
		(0 0 0.1601)
		(0 0 0.1626)
		(0 0 0.1651)
		(0 0 0.1676)
		(0 0 0.1701)
		(0 0 0.1726)
		(0 0 0.1751)
		(0 0 0.1776)
		(0 0 0.1801)
		(0 0 0.1826)
		(0 0 0.1851)
		(0 0 0.1876)
		(0 0 0.1901)
		(0 0 0.1926)
		(0 0 0.1951)
		(0 0 0.1976)
		(0 0 0.2001)
		(0 0 0.2026)
		(0 0 0.2051)
		(0 0 0.2076)
		(0 0 0.2101)
		(0 0 0.2126)
		(0 0 0.2151)
		(0 0 0.2176)
		(0 0 0.2201)
		(0 0 0.2226)
		(0 0 0.2251)
		(0 0 0.2276)
		(0 0 0.2301)
		(0 0 0.2326)
		(0 0 0.2351)
		(0 0 0.2376)
		(0 0 0.2401)
		(0 0 0.2426)
		(0 0 0.2451)
		(0 0 0.2476)
		(0 0 0.2501)
		(0 0 0.2526)
		(0 0 0.2551)
		(0 0 0.2576)
		(0 0 0.2601)
		(0 0 0.2626)
		(0 0 0.2651)
		(0 0 0.2676)
		(0 0 0.2701)
		(0 0 0.2726)
		(0 0 0.2751)
		(0 0 0.2776)
		(0 0 0.2801)
		(0 0 0.2826)
		(0 0 0.2851)
		(0 0 0.2876)
		(0 0 0.2901)
		(0 0 0.2926)
		(0 0 0.2951)
		(0 0 0.2976)
		(0 0 0.3001)
		(0 0 0.3026)
		(0 0 0.3051)
		(0 0 0.3076)
		(0 0 0.3101)
		(0 0 0.3126)
		(0 0 0.3151)
		(0 0 0.3176)
		(0 0 0.3201)
		(0 0 0.3226)
		(0 0 0.3251)
		(0 0 0.3276)
		(0 0 0.3301)
		(0 0 0.3326)
		(0 0 0.3351)
		(0 0 0.3376)
		(0 0 0.3401)
		(0 0 0.3426)
		(0 0 0.3451)
		(0 0 0.3476)
		(0 0 0.3501)
		(0 0 0.3526)
		(0 0 0.3551)
		(0 0 0.3576)
		(0 0 0.3601)
		(0 0 0.3626)
		(0 0 0.3651)
		(0 0 0.3676)
		(0 0 0.3701)
		(0 0 0.3726)
		(0 0 0.3751)
		(0 0 0.3776)
		(0 0 0.3801)
		(0 0 0.3826)
		(0 0 0.3851)
		(0 0 0.3876)
		(0 0 0.3901)
		(0 0 0.3926)
		(0 0 0.3951)
		(0 0 0.3976)
		(0 0 0.4001)
		(0 0 0.4026)
		(0 0 0.4051)
		(0 0 0.4076)
		(0 0 0.4101)
		(0 0 0.4126)
		(0 0 0.4151)
		(0 0 0.4176)
		(0 0 0.4201)
		(0 0 0.4226)
		(0 0 0.4251)
		(0 0 0.4276)
		(0 0 0.4301)
		(0 0 0.4326)
		(0 0 0.4351)
		(0 0 0.4376)
		(0 0 0.4401)

        );

        // Fields to be probed 
        fields ( p U );

        // Write at same frequency as fields
        outputControl   timeStep;//outputTime;
        outputInterval  1;
    }

   /*pressureDrop
   {
     type patchAverage;
     functionObjectLibs
     (
         "libsimpleFunctionObjects.so"
     );
     verbose true;
     patches
     (
         fbGasin
         fbOut
     );
     fields
     (
         p
     );
     factor  1;
   }*/
}
// ************************************************************************* //
